src/rpc/psdims.get-pending-notifications.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:xmime5="http://www.w3.org/2005/05/xmlmime"
  xmlns:psdims="urn:psdims">
 <SOAP-ENV:Body>
  <psdims:notifications>
   <friend-request>
    <user>
     <name>
      <string></string>
     </name>
     <send-date>0</send-date>
    </user>
    <user>
     <name>
      <string></string>
     </name>
     <send-date>0</send-date>
    </user>
   </friend-request>
   <chats-with-messages>
    <chat>
     <chat-id>0</chat-id>
    </chat>
    <chat>
     <chat-id>0</chat-id>
    </chat>
   </chats-with-messages>
   <last-timestamp>0</last-timestamp>
  </psdims:notifications>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
